Lotlab/nrf51822-keyboard/main.c
/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief 上传电量数据
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t battery_level;

    // TODO: do some measure here!
    if (adc_sample > 500 && adc_sample < 650)
        battery_level = (adc_sample - 500) / 1.5;
    else
        battery_level = 0;

    //battery_level = adc_sample / 10;

    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
    {
        APP_ERROR_HANDLER(err_code);
    }
}

/**@brief 电量测量计时器溢出处理函数
 *
 * @details 当电量状态需要测量时调用此函数
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    nrf_adc_start();
}

/**@brief 电量上报计时器溢出处理函数
 *
 * @details 当电量状态需要上报时调用此函数
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_send_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

/**@brief Function for handling the keyboard scan timer timeout.
 *
 * @details This function will be called each time the keyboard scan timer expires.
 *
 */
static void keyboard_scan_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    const uint8_t *key_packet;
    uint8_t key_packet_size;
    if (new_packet(&key_packet, &key_packet_size))
    {
        for (uint_fast8_t i = 0; i < key_packet_size; i++)
        {
            if (key_packet[i] == KC_FN15)
            {
                sleep_mode_enter();
            }
        }
        if(passkey_enter_index < 6)
        {
            for(uint_fast8_t i = 0;i < key_packet_size; i++)
            {
                switch(key_packet[i])
                {
                    case KC_1:
                    case KC_KP_1:
                        passkey_entered[passkey_enter_index++] = '1';
                        break;
                    case KC_2:
                    case KC_KP_2:
                        passkey_entered[passkey_enter_index++] = '2';
                        break;
                    case KC_3:
                    case KC_KP_3:
                        passkey_entered[passkey_enter_index++] = '3';
                        break;
                    case KC_4:
                    case KC_KP_4:
                        passkey_entered[passkey_enter_index++] = '4';
                        break;
                    case KC_5:
                    case KC_KP_5:
                        passkey_entered[passkey_enter_index++] = '5';
                        break;
                    case KC_6:
                    case KC_KP_6:
                        passkey_entered[passkey_enter_index++] = '6';
                        break;
                    case KC_7:
                    case KC_KP_7:
                        passkey_entered[passkey_enter_index++] = '7';
                        break;
                    case KC_8:
                    case KC_KP_8:
                        passkey_entered[passkey_enter_index++] = '8';
                        break;
                    case KC_9:
                    case KC_KP_9:
                        passkey_entered[passkey_enter_index++] = '9';
                        break;
                    case KC_0:
                    case KC_KP_0:
                        passkey_entered[passkey_enter_index++] = '0';
                        break;
                    default:
                        break;
                }
            }
            if(passkey_enter_index == 6)
                 sd_ble_gap_auth_key_reply(passkey_conn_handle,BLE_GAP_AUTH_KEY_TYPE_PASSKEY ,passkey_entered); 
            return;
        }
        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            keys_send(key_packet_size, (uint8_t *)&key_packet[0]);
        }
    }
}

/**@brief 计时器初始化函数
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, true);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_send_timeout_handler);

    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&m_battery_timer_meas_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);

    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_keyboard_scan_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                keyboard_scan_timeout_handler);

    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t err_code;
    ble_gap_conn_params_t gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HID_KEYBOARD);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

    //下面是添加设置配对密码
    /*																			
    uint8_t passcode[] = "000000";
    ble_opt_t 	static_option;
    static_option.gap_opt.passkey.p_passkey = passcode;
    err_code =  sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &static_option);
    APP_ERROR_CHECK(err_code);
    */
}

